backend/app/controllers/home_controller.rb

    @birthday_users = User.where("EXTRACT(month FROM birthday) = ? AND EXTRACT(day FROM birthday) = ?", today.month, today.day)

    # ベストタイム表示で使うコントローラー
    @players = User.where(user_type: :player).order(generation: :asc)
    @male_players = @players.select { |p| p.male? }
    @female_players = @players.select { |p| p.female? }
---
SELECT "users".* FROM "users" WHERE "users"."user_type" = $1 ORDER BY "users"."generation" ASC  [["user_type", 0]]
SELECT "users".* FROM "users" WHERE "users"."user_type" = $1  [["user_type", 0]]