backend/app/controllers/home_controller.rb

SELECT "attendance".* FROM "attendance" INNER JOIN "events" ON "events"."id" = "attendance"."attendance_event_id" AND "events"."type" IN ($1, $2) WHERE "attendance"."user_id" = $3 AND "events"."date" BETWEEN $4 AND $5  [["type", "AttendanceEvent"], ["type", "Competition"], ["user_id", 205], ["date", "2025-08-01"], ["date", "2025-08-31"]]
SELECT "events".* FROM "events" WHERE "events"."date" BETWEEN $1 AND $2 ORDER BY "events"."date" ASC  [["date", "2025-08-01"], ["date", "2025-08-31"]]
---
  def index
    # カレンダーの表示で使うコントローラー
    @current_month = Date.current

    # STI構造では全てのイベントをEventテーブルから取得
    all_events = Event
      .where(date: @current_month.beginning_of_month..@current_month.end_of_month)
      .order(date: :asc)

    # ログインユーザーの出席情報を取得
    @user_attendance_by_event = {}
    current_user_auth.user.attendance
      .joins(:attendance_event)
      .where(events: { date: @current_month.beginning_of_month..@current_month.end_of_month })
      .each do |attendance|
        @user_attendance_by_event[attendance.attendance_event_id] = attendance
      end

    # 誕生日データを取得（モデルスコープを活用）
    @birthdays_by_date = {}
    birthday_users = User.players.birthday_in_month(@current_month.month)

    birthday_users.each do |user|
      birthday_this_month = Date.new(@current_month.year, user.birthday.month, user.birthday.day)
      @birthdays_by_date[birthday_this_month] ||= []
      @birthdays_by_date[birthday_this_month] << user
    end

    # イベントを日付ごとにグループ化
    @events_by_date = {}
    all_events.each do |event|

SELECT "styles".* FROM "styles"
---
    @female_players = @players.select { |p| p.female? }
    @default_tab = params[:tab] || (current_user_auth.user.male? ? "male" : "female")
    @sort_by = params[:sort_by]
    @events = Style.all.map do |style|