backend/app/controllers/member_controller.rb

  def index
    # Eager loadingでN+1クエリを解決し、必要なレコードも事前取得
    @users = User.includes(records: :style).all.sort_by { |user| [ user.generation, user.name ] }
    @grouped_by_generation = @users.group_by { |user| user.generation }

    # ユーザータイプの表示順序を定義
    type_order = { "player" => 0, "coach" => 1, "director" => 2 }
    @grouped_by_type = @users.group_by { |user| user.user_type }
                            .sort_by { |type, _| type_order[type] || 3 }
                            .to_h

    # 各ユーザーの各種目のベストタイムを事前に計算してハッシュ化
    @user_best_records = {}
    @users.each do |user|
      @user_best_records[user.id] = {}
      user.records.group_by(&:style_id).each do |style_id, records|
---
SELECT "styles".* FROM "styles" WHERE "styles"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17)
SELECT "users".* FROM "users"
SELECT "records".* FROM "records" WHERE "records"."user_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38)